In [1]:
import MySQLdb as mdb

### Load  the data drom MySQL server to pandas dataframe and examine it

In [2]:
import pandas as pd
con = mdb.connect('127.0.0.1', 'root', 'danalaura', 'datascience');

In [3]:
#with con:
# cur = con.cursor()
 #cur.execute(SELECT  FROM mysql_master WHERE type='table';")
# rows = cur.fetchall()
# df = pd.DataFrame( [[ij for ij in i] for i in rows] )
# df.rename(columns={0: 'Random Number One', 1: 'Random Number Two', 2: 'Random Number Three'}, inplace=True);
# print(df.head(20))

#### Customer table

In [4]:
customer= pd.read_sql("SELECT * FROM customer", con)

In [5]:
customer.head()

   id               name                                email
0   1  Domnall Jagannath   oelmagic.ah@oidzc1zgxrktxdwdkxm.cf
1   2     Adedayo Fúlvio         5elianaycastro6@trashmail.pw
2   3         Cupid Imke        crabeh_hiphopb@alormbf88nd.cf
3   4    Merja Konstanty                     zyesco@bnckms.ga
4   5    Juvenal Darshan  branahaseeb01@vl2ivlyuzopeawoepx.cf

#### Merchant table

In [6]:
merchant= pd.read_sql("SELECT * FROM  merchant", con)

In [7]:
merchant.head()

   id          name                                        description
0   1   Signal Arts  Lorem ipsum dolor sit amet, consectetur adipis...
1   2  Monarch Arts  Lorem ipsum dolor sit amet, consectetur adipis...
2   3    Marsecuriy  Lorem ipsum dolor sit amet, consectetur adipis...
3   4     Smilelife  Lorem ipsum dolor sit amet, consectetur adipis...
4   5    Bridgestar  Lorem ipsum dolor sit amet, consectetur adipis...

#### Order_items table

In [8]:
order_items= pd.read_sql("SELECT * FROM  order_items", con)

In [9]:
order_items.head()

   id  order  product_variation   price  quantity
0   1      1                 66    9.61         3
1   2      1                  1   11.53         2
2   3      1                 30   15.35         3
3   4      1                 60   72.47         2
4   5      1                 13  125.26         3

In [10]:
order_items.rename(columns={'product_variation':'id_variation'}, inplace=True)

In [11]:
order_items.rename(columns={'price':'price_variation'}, inplace=True)

In [12]:
order_items.head()

   id  order  id_variation  price_variation  quantity
0   1      1            66             9.61         3
1   2      1             1            11.53         2
2   3      1            30            15.35         3
3   4      1            60            72.47         2
4   5      1            13           125.26         3

#### Orders table

In [13]:
orders= pd.read_sql("SELECT * FROM  orders", con)

In [14]:
orders.head()

   id  customer           placed_on  total_cost  total_tax  subtotal
0   1         4 2017-03-05 16:55:52      884.34     101.74    782.60
1   2        22 2015-09-05 10:20:52      972.40     111.87    860.53
2   3        19 2016-01-24 11:38:27      105.91      12.18     93.73
3   4        10 2016-04-25 10:43:25      647.20      74.46    572.74
4   5         4 2017-12-02 06:27:31      343.27      39.49    303.78

In [15]:
max_time =orders['placed_on'].max()

In [16]:
min_time =orders['placed_on'].min()

In [17]:
min_time

Timestamp('2014-01-07 01:28:36')

In [18]:
max_time

Timestamp('2018-12-12 12:13:32')

#### product_variations table

In [19]:
product_variations= pd.read_sql("SELECT * FROM product_variations", con)

In [20]:
product_variations.head()

   id  product       name
0   1        2        Red
1   2       11      Small
2   3       10      Green
3   4       23  Checkered
4   5       10       Blue

In [21]:
product_variations.rename(columns={'id':'id_variation'}, inplace=True)

In [22]:
product_variations.rename(columns={'product':'id_product'}, inplace=True)

In [23]:
product_variations.head()

   id_variation  id_product       name
0             1           2        Red
1             2          11      Small
2             3          10      Green
3             4          23  Checkered
4             5          10       Blue

#### product table

In [24]:
products= pd.read_sql("SELECT * FROM products", con)

In [25]:
products.rename(columns={'id':'id_product'}, inplace=True)

In [26]:
products.rename(columns={'price':'price_merchant'}, inplace=True)

In [27]:
products.head()

,id_product,merchant,name,description,price_merchant,sku
0,1,2,Large table,A great table,102.12,8437152631
1,2,11,Cotton t-shirt,100% cotton t-shirt,11.99,1437367336
2,3,3,Wool coat,Sturdy 100% wool,400.50,3977592277
3,4,4,See-through corded telephone,None,26.78,8241503020
4,5,3,V-neck t-shirt,100% cotton,10.00,4556771762

### Questions

#### 1. Are there incidences of shops are increasing their prices? Does it occur on a regular basis?

__product_variation__ table was merged with __order_items__ and __products__ table in order to gather together the product and their variations, and ultimately compare their original prices with the ones from merchants. However, the datatime values in __orders__ table seem to not be related to any other tables, which made imposible to analyse how often the prices are changeing.

In [28]:
app_data= order_items.merge(product_variations, on = 'id_variation', how = 'left')

In [29]:
columns = [ 'id', 'quantity','name' ]
app_data=app_data.drop(columns, axis=1)

In [30]:
app_data.head()

   order  id_variation  price_variation  id_product
0      1            66             9.61          37
1      1             1            11.53           2
2      1            30            15.35          15
3      1            60            72.47          35
4      1            13           125.26          32

In [31]:
app_data1= app_data.merge(products, on = 'id_product', how = 'left')

In [32]:
columns = ['order', 'merchant','name', 'description','sku' ]
app_data1=app_data1.drop(columns, axis=1)

In [33]:
app_data1['difference_price']=app_data1['price_merchant']-app_data1['price_variation']

In [34]:
app_data1['percentage_difference%']=(app_data1['difference_price']/app_data1['price_merchant'])*100

In [35]:
app_data1.head()

,id_variation,price_variation,id_product,price_merchant,difference_price,percentage_difference%
0,66,9.61,37,10.00,0.39,3.900000
1,1,11.53,2,11.99,0.46,3.836530
2,30,15.35,15,15.99,0.64,4.002502
3,60,72.47,35,75.60,3.13,4.140212
4,13,125.26,32,130.55,5.29,4.052087

In [36]:
app_data1.describe()

,id_variation,price_variation,id_product,price_merchant,difference_price,percentage_difference%
count,1081.000000,1081.000000,1081.000000,1081.000000,1081.000000,1081.000000
mean,34.927845,49.275883,20.361702,52.435402,3.159519,5.991689
std,19.905201,59.361110,11.140998,63.034290,4.522971,2.924582
min,1.000000,0.880000,1.000000,0.990000,0.000000,0.000000
25%,17.000000,11.370000,10.000000,11.990000,0.610000,3.822751
50%,35.000000,27.280000,20.000000,30.000000,1.360000,6.222222
75%,52.000000,76.490000,30.000000,80.000000,4.400000,8.466667
max,69.000000,400.020000,38.000000,400.500000,41.080000,11.322222

#### MySQL Querry

In [ ]:

SELECT DISTINCT oi.product_variation , oi.price , pv.product , p.price, FORMAT (ABS(p.price-oi.price), 2) difference
FROM order_items oi
    LEFT JOIN product_variations pv ON oi.product_variation = pv.id
    LEFT JOIN  products p ON pv.product= p.id
ORDER BY  oi.product_variation;

#order_items.product_variation = product_variations.id;

__Answer__: the shops do increase their prices (the column "difference_price" indicates the difference between real price and the price imposed by shops) with a maximum of 41 $, but there was not enough information on the time the prices increase, as the only datatime values are contained in a table where there is no information about the products sold or the shops that were sold by.

#### What is the  average annual price increase of products in this database, if any.

A stated above, thee datatime values in orders table seem to not be related to any other tables. However, considering they would, the time period for the registered orders is aproximative 4 years. I have applied this period of time in the average annual price increase.

 Formula used to calculate the average annual price increase= {[(Max_price-Min_price)/Min_price]/(time)} * 100

In [35]:
annual_pi=app_data1.groupby(['id_product', 'id_variation'],as_index=False).agg({'price_variation': lambda x: (((x.max()-x.min())/x.min())/4)*100})

In [36]:
annual_pi.rename(columns={'price_variation':'annual_pi'}, inplace=True)

In [37]:
annual_pi.head()

   id_product  id_variation  annual_pi
0           1            11   2.739501
1           2             1   2.483901
2           2            10   1.932030
3           3            14   2.823994
4           4            15   2.973199

#### MySQL Querry

#### Determine the time interval

In [ ]:
SELECT placed_on
FROM orders 
WHERE  placed_on = (SELECT MAX(placed_on) FROM orders) ;
SELECT placed_on
FROM orders 
WHERE  placed_on = (SELECT MIN(placed_on) FROM orders) ;

#### Function for average annual price increase

In [ ]:
DELIMITER $$
 
CREATE FUNCTION AnnualPI(a float, b float) RETURNS float
    DETERMINISTIC
BEGIN
    DECLARE API, maxprice, minprice float;
    SET maxprice=0;
    SET minprice=0;
     
    SELECT MAX(a-b) INTO maxprice;
    SELECT MIN(a-b) INTO minprice;
 SET API = (maxprice-minprice/minprice)/4*100;
    
 
 RETURN (API);
END

#### Procedure

In [ ]:
DELIMITER $$
 
CREATE PROCEDURE GetAnnualPI(
    IN  product INT,
    IN  product_variations INT,
    OUT annualpi  float
)
BEGIN
    DECLARE prodprice DOUBLE;
    DECLARE ordprice DOUBLE;
 
    SELECT price INTO prodprice
    FROM products,product_variations
    WHERE product_variations.product= products.id;
    
    SELECT price INTO ordprice
    FROM order_items, product_variations
    WHERE order_items.product_variation = product_variations.id;
 
    SELECT ANNUALPI(prodprice,  ordprice) 
    INTO annualpi;
 
END

#### If it were being redeveloped, what changes would you make to the database schema given to make it more flexible?

I think the answer to this question depends on the type of analysis required. However, concerning the previous questions,  I would suggest to add the product_id into the orders table, in order to be able to track which products and when were sold.

#### Does the query (/queries) you wrote scale? What if there were hundreds of thousands of products, customers, variations and orders? What changes might you make to your technique, or the database itself, to optimize this sort of analysis?

The queries I wrote does not scale as a MySQL single system (MySQL was originally designed as a single-node system and not with the modern data concept in mind).A given MySQL query can neither scale among multiple CPU cores in a single system nor execute distributed queries across multiple nodes. In case of large data volumes, one must use shrading or split the data sets over multiple nodes or instances. However, shredding solutions in MySQL are manual and make application code more complex, with a poor performance.
A solution would be MongoDB or Cassandra, where data is automatically distributed across all nodes in a cluster and manual shredding is not necessary.

#### Without rewriting it, how would your analysis change if the prices were presented in multiple currencies?

In case of multiple currencies, a conversion function would be necessary to be applied to any currency, expressed in term of fraction of how much the  currency represent in a dollar.

#### Based on your findings above, would you recommend building the new feature? Why or why not?

Since overal inflation has several causes,  the demand-pull inflation and cost-push inflation represent very important setting in the merchant bussiness. A pricing decision support tool  based on product’s demand on the price of competing products would play a very important role for the bussiness. Hence, I would recommend building the aforementioned feature.